package app

import (
	"github.com/aryanwalia2003/git-stats/internal/ui/theme"
	"github.com/charmbracelet/lipgloss"
)

// GithubLogo returns the styled ASCII logo for the dashboard.
func GithubLogo() string {
	logo := `
  ██████╗ ██╗████████╗██╗  ██╗██╗   ██╗██████╗ 
 ██╔════╝ ██║╚══██╔══╝██║  ██║██║   ██║██╔══██╗
 ██║  ███╗██║   ██║   ███████║██║   ██║██████╔╝
 ██║   ██║██║   ██║   ██╔══██║██║   ██║██╔══██╗
 ╚██████╔╝██║   ██║   ██║  ██║╚██████╔╝██████╔╝
  ╚═════╝ ╚═╝   ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═════╝ 
`

	return lipgloss.NewStyle().
		Foreground(theme.Primary).
		Bold(true).
		Margin(1, 0, 2, 0). // Top, Right, Bottom, Left margin
		Render(logo)
}